export default class ReviewService {
    // DATA
    static #reviews = [
        {id: 1, person: "Олена М.", avatar: "person1.jpg", text: "Дуже затишне кафе! Смакувала пасту Карбонара – вона просто ідеальна: ніжна та ароматна. Атмосфера спокійна, персонал уважний. Обов’язково повернусь ще!"},
        {id: 2, person: "Андрій К.", avatar: "person2.jpg", text: "Вперше був у цьому кафе на діловому обіді. Борщ із пампушками – як удома, а каву подають краще, ніж у багатьох кав’ярнях. Гарне співвідношення ціна-якість."},
        {id: 3, person: "Марія М.", avatar: "person3.jpg", text: "Замовляла чізкейк і лимонад – справжнє задоволення! Інтер’єр світлий, сучасний, ідеально підходить для зустрічей із подругами. Дуже приємне місце!"},
        {id: 4, person: "Володимир П.", avatar: "person4.jpg", text: "Були з дружиною на вечерю. Стейк із лосося – один із найкращих, які я куштував у місті. Персонал порадив вино, яке чудово підійшло до страви. Рекомендую!"},
    ]

    // METHODS
    static getReviews() {
        try {
            return this.#reviews;
        } catch(error){
            console.log("SKLT | ERROR getReviews |", error);
            return []
        }
    }
}